# GetWllHoleObjIgnClsr

## Description
Gets whether an object in the 3D Wall Hole group of a plug-in object ignores wall closures.

```pascal
FUNCTION GetWllHoleObjIgnClsr(object : HANDLE): BOOLEAN;
```

```python
def vs.GetWllHoleObjIgnClsr(object):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object in the 3D Wall Hole group of a plug-in object|

## See Also
VS Functions:
SetWllHoleObjIgnClsr

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Custom